**Pandas** is built on top of *Numpy*. Pandas has the following features:
    * Data structures with labeled axes
    * Arithmetic Operations and reductions
    * Integrated time series functionality
    * Handling of Missing data
    * Merge, sorting, filtering and other functionlities

###Data Structures

Pandas has two kinds of data structure: *Series* and *DataFrame*

####Series

* Series is a one dimensional array-like object containing an array of data and an associated array of data labels called index

In [15]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [6]:
obj = Series([4,7,-5,3])

In [7]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

* Index is on the left and the values on the right 
* Default type for index is integers

In [8]:
obj.values

array([ 4,  7, -5,  3])

In [9]:
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

We can create our own index as well to identify each data point

In [10]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [11]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2['a']

-5

Numpy array operations can be done on the Series and the index-value link is preseved

Filtering

In [14]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

* Multiplication and math functions

In [15]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [17]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

Series is a fixed length ordered dict, as it is a mapping of index to data. It can be used as a dict

In [18]:
'a' in obj2

True

In [20]:
'e' in obj2

False

You can create a Series from a Python dict

In [21]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [24]:
obj3 = Series(sdata)

In [25]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [26]:
states = ['California','Ohio','Oregon','Texas']

In [28]:
obj4 = Series(sdata,index=states)

In [29]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [31]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [34]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [37]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [40]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [41]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [42]:
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [44]:
obj4.name = 'population'

In [45]:
obj4.index.name = 'states'

In [46]:
obj4

states
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [48]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [49]:
obj.index = ['Bob','Steve','Jeff','Ryan']

In [50]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

###DataFrame

A DataFrame represents a tabular, spreadsheet-like data structure containing an ordered collection of columns, each of which can be a different value type (numeric,string, boolean, etc.). The DataFrame has both a row and column index; it can be thought of as a dict of Series.

One of the most common way to create a DataFrame is from a dict of equal-length lists or NumPy arrays

In [3]:
from pandas import DataFrame

data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}

In [4]:
frame = DataFrame(data)

In [5]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

If you specify a sequence of columns, the DataFrame’s columns will be exactly what you pass:

In [6]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [7]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],index=['one', 'two', 'three', 'four', 'five'])

In [8]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

A column in a DataFrame can be retrieved as a Series either by dict-like notation or by attribute:

In [9]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [10]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

Returned Series have the same index as the DataFrame, and their name attribute has been appropriately set.

Rows can also be retrieved by position or name

In [11]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

Column could be assigned a scalar value or an array of values

In [12]:
frame2['debt'] = 16.5

In [13]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [16]:
frame2['debt'] = np.arange(5.)

In [17]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

When assigning lists or arrays to a column, the value’s length must match the length of the DataFrame. If you assign a Series, it will be instead conformed exactly to the DataFrame’s index, inserting missing values in any blanks:

In [26]:
val = Series([-1.2, -1.5, -1.7],index=['two', 'four', 'five'])

In [27]:
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [28]:
frame2['debt'] = val

In [29]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [30]:
frame2['eastern'] = frame2.state == 'Ohio'

In [31]:
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [33]:
del frame2['eastern']

In [34]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [35]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

Another common form of data is a nested dict of dicts format:

In [36]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [37]:
frame3 = DataFrame(pop)

In [38]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [39]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

The keys in the inner dicts are unioned and sorted to form the index in the result

In [44]:
pdata = {'Ohio': frame3['Ohio'][:-1],
'Nevada': frame3['Nevada'][:2]}

In [46]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [47]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [48]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [49]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

the values attribute returns the data contained in the DataFrame as a 2D ndarray:

In [50]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

If the DataFrame’s columns are different dtypes, the dtype of the values array will be chosen to accomodate all of the columns:

###Reindexing

A critical method on pandas objects is reindex , which means to create a new object with the data conformed to a new index.

In [51]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [52]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

Calling reindex on this Series rearranges the data according to the new index, introducing missing values if any index values were not already present:

In [53]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [54]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [55]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

For ordered data like time series, it may be desirable to do some interpolation or filling of values when reindexing. The method option allows us to do this, using a method such
as ffill which forward fills the values:

In [58]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [59]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [60]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

With DataFrame, reindex can alter either the (row) index, columns, or both. When passed just a sequence, the rows are reindexed in the result:

In [61]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])

In [62]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [63]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])

In [64]:
frame2

   Ohio  Texas  California
a     0      1           2
b   NaN    NaN         NaN
c     3      4           5
d     6      7           8

The columns can be reindexed using the columns keyword:

In [65]:
states = ['Texas', 'Utah', 'California']

In [66]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [67]:
frame.reindex(index=['a', 'b', 'c', 'd'],columns=states)

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

In [68]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

Interpolation will only apply row-wise

Reindexing can be done more succinctly by label-indexing with ix

In [71]:
frame.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a      1   NaN           2
b    NaN   NaN         NaN
c      4   NaN           5
d      7   NaN           8

###Dropping entries from an axis

In [72]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [73]:
obj.drop('c')

a    0
b    1
d    3
e    4
dtype: float64

In [74]:
obj.drop(['d', 'c'])

a    0
b    1
e    4
dtype: float64

In [75]:
data = DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [79]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [76]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [77]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [78]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

###Indexing, selection, and filtering

Series indexing ( obj[...] ) works analogously to NumPy array indexing, except you can use the Series’s index values instead of only integers.

In [80]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [81]:
obj['b']

1.0

In [82]:
obj[1]

1.0

In [83]:
obj[2:4]

c    2
d    3
dtype: float64

In [84]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [85]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [86]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [87]:
obj['b':'c']

b    1
c    2
dtype: float64

In [88]:
obj['b':'c'] = 5

In [89]:
obj

a    0
b    5
c    5
d    3
dtype: float64

Indexing into a DataFrame is for retrieving one or more columns either with a single value or sequence

In [90]:
data = DataFrame(np.arange(16).reshape((4, 4)),
index=['Ohio', 'Colorado', 'Utah', 'New York'],
columns=['one', 'two', 'three', 'four'])

In [91]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [92]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [93]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [94]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [95]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [96]:
data[data < 5] = 0

In [97]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

The special indexing field ix . It enables you to select a subset of the rows and columns from a DataFrame with NumPy-like notation plus axis labels.

In [98]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [99]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [100]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [101]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [102]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

###Arithmetic and data alignment

One of the most important pandas features is the behavior of arithmetic between objects with different indexes. When adding together objects, if any index pairs are not the same, the respective index in the result will be the union of the index pairs.

In [103]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [104]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [105]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [106]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [107]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [108]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
index=['Ohio', 'Texas', 'Colorado'])

In [109]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [112]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [113]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [114]:
df1+df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

In [115]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [116]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [117]:
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [118]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [121]:
df1+df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [119]:
df1.add(df2,fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [120]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

In [122]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [123]:
frame

               b         d         e
Utah   -0.048596 -0.405570  0.529970
Ohio   -0.040852 -2.265796 -0.873886
Texas   0.470401  0.269321 -0.776708
Oregon -0.794004  0.005212 -0.350902

In [124]:
np.abs(frame)

               b         d         e
Utah    0.048596  0.405570  0.529970
Ohio    0.040852  2.265796  0.873886
Texas   0.470401  0.269321  0.776708
Oregon  0.794004  0.005212  0.350902

In [125]:
f = lambda x: x.max() - x.min()

In [126]:
frame.apply(f)

b    1.264405
d    2.535116
e    1.403857
dtype: float64

In [127]:
frame.apply(f, axis=1)

Utah      0.935540
Ohio      2.224943
Texas     1.247108
Oregon    0.799216
dtype: float64

The function passed to apply need not return a scalar value, it can also return a Series with multiple values:

In [129]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])

In [130]:
frame.apply(f)

            b         d         e
min -0.794004 -2.265796 -0.873886
max  0.470401  0.269321  0.529970

Element-wise Python functions can be used, too. Suppose you wanted to compute a formatted string from each floating point value in frame . You can do this with applymap :

In [131]:
format = lambda x: '%.2f' % x

In [132]:
frame.applymap(format)

            b      d      e
Utah    -0.05  -0.41   0.53
Ohio    -0.04  -2.27  -0.87
Texas    0.47   0.27  -0.78
Oregon  -0.79   0.01  -0.35

In [133]:
frame['e'].map(format)

Utah       0.53
Ohio      -0.87
Texas     -0.78
Oregon    -0.35
Name: e, dtype: object

###Sorting

Sorting a data set by some criterion is another important built-in operation. To sort lexicographically by row or column index, use the sort_index method,

In [134]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])

In [135]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [136]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
columns=['d', 'a', 'b', 'c'])

In [137]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [138]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [139]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

To sort a Series by its values, use its order method:

In [140]:
obj = Series([4, 7, -3, 2])

In [141]:
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [142]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])

In [143]:
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

On DataFrame, you may want to sort by the values in one or more columns. To do so, pass one or more column names to the by option:

In [144]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [145]:
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [146]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [147]:
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7